---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfile
source: html/896820d0-8a2f-f67e-bcd6-de74da7e4b05.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfile

Defines parameters for Sigma Profile structural section.

## Syntax (C#)
```csharp
public class StructuralSectionSigmaProfile : StructuralSectionColdFormed
```